#include <stdio.h>
#include <windows.h>

int main () {
    //виставляю кодировку виводу консолі в UTF-8
    SetConsoleOutputCP(65001);
    SetConsoleCP(65001);

    //  Задача 3. Трейдер-початківець вирішив підрахувати свій баланс. Він має
    // початковий капітал у 10000.0 біткоїнів і робить 100 000 дрібних транзакцій,
    // додаючи по 0.00001 BTC на кожному кроці.
    // Пояснення
    // BTC (Bitcoin / біткоїн) – це цифрова валюта. Вона ділиться на 100 000 000
    // дрібних часток (сатоші).
    // Сатоші (Satoshi) – це найменша неділима частка біткоїна (BTC), названа на
    // честь творця мережі Bitcoin Сатоші Накамото (Satoshi Nakamoto).
    // BTC = 100 000 000 сатоші
    // сатоші = 0.00000001 BTC
    // Навіщо це потрібно? У фінансових та криптовалютних системах дрібні суми
    // зручніше вимірювати в цілих числах сатоші (1000 sat), а не у дробах 0.00001000
    // BTC, щоб уникати плутанини з нулями та помилок округлення дробових типів
    // даних!
    // Завдання. Напишіть програму, яка за допомогою циклу обчислює підсумковий
    // баланс двома паралельними способами і яка виконує такі кроки:
    // 1. Oголошення вихідних даних:
    // ➢ Оголосити константу кількості транзакцій, яка дорівнює 100000.
    // ➢ Оголосити константу поточного курсу валюти, яка дорівнює
    // 65000.0.

    // ➢ Створити дві змінні початкового балансу:
    // ▪ float balance_float = 10000.0f;
    // ▪ double balance_double = 10000.0;
    // ➢ Створити змінні для суми однієї транзакції (0.00001):
    // ▪ float sum_float = 0.00001f;
    // ▪ double sum_double = 0.00001;

    // 2. Підрахунок у циклі:

    // В циклі (for або while) на кожному кроці (100 000 разів) паралельно
    // додавати транзакцію до обох змінних:
    // balance_float += sum_float;
    // balance_double += sum_double;

    // 3. Аудит та обчислення збитків:

    // ➢ Обчислити втрачену суму криптовалюти:
    // double error_btc = balance_double – (double)balance_float;
    // ➢ Перевести втрачену суму в долари США.
    // 4. Виведення результатів:
    // ➢ Вивести порівняння отриманих балансів із точністю 8 знаків після
    // крапки (%.8f та %.8lf).
    // ➢ Вивести накопичену помилку в BTC та реальні грошові збитки у
    // доларах США з точністю до центів (%.2f).

    // Приклад можливого виведення програми в консоль:
    // ФІНАНСОВИЙ АУДИТ КРИПТОГАМАНЦЯ ===
    // Курс обміну: 1 BTC = $65000.00 USD
    // Баланс float : _________ BTC
    // Баланс double : _________ BTC
    // ----------------------------------------
    // Втрачена сума у BTC : _________ BTC
    // Фінансові збитки : __________USD

    const int TRANSACTIONS = 100000;
    const double BTC_TO_USD = 65000.0;

    float balance_float = 10000.0f;
    double balance_double = 10000.0;

    float sum_float = 0.00001f;
    double sum_double = 0.00001;

    for (int i = 0; i < TRANSACTIONS; i++) {
        balance_float += sum_float;
        balance_double += sum_double;
    }

    double error_btc = balance_double - (double)balance_float;
    double financial_losses = error_btc * BTC_TO_USD;

    printf("ФІНАНСОВИЙ АУДИТ КРИПТОГАМАНЦЯ ===");
    printf("Курс обміну: 1 BTC = $%.2f USD", BTC_TO_USD);
    printf("Баланс float : %.8f BTC", balance_float);
    printf("Баланс double : %.8lf BTC", balance_double);
    printf("----------------------------------------");
    printf("Втрачена сума у BTC : %.8f BTC", error_btc);
    printf("Фінансові збитки : $%.2f USD", financial_losses);

    return 0;
}