#include <stdio.h>

int main () {
    // Задача 2. Для безпечного входу в систему робота-асистента додаток
    // використовує додаткове шифрування літерних кодів. Щоб сторонній спостерігач
    // не перехопив пароль у відкритому вигляді, смарт-бот зашифровує кожну велику
    // латинську літеру коду зі зміщенням на K позицій уперед по алфавіту (наприклад,
    // при K = 3 символ 'A' → 'D', а 'Z' → 'C').

    // Завдання. Напишіть програму, яка:
    // 1. Отримує від користувача одну велику латинську літеру (тип char) та
    // число зміщення K (тип int).
    // 2. Виконує перевірку коректності введення двома різними способами (для
    // порівняння у коді):
    // Спосіб 1 – за допомогою функції з бібліотеки <ctype.h.
    // Спосіб 2 – за допомогою аналізу ASCII-кодів. ( перевірити ту саму
    // умову безпосередньо через діапазон ASCII-кодів.
    // 3. Якщо символ не є великою латинською літерою (за результатами обох
    // перевірок) – виводить повідомлення про помилку.
    // 4. Якщо символ коректний – виконує шифрування за допомогою символьної
    // арифметики.
    // 5. Виводить на екран:

    // ➢ результати обох перевірок (чи збігаються висновки функції та
    // порівняння ASCII-кодів).
    // ➢ введений символ та його десятковий ASCII-код (%c та %d).
    // ➢ зашифрований символ та його новий ASCII-код.

    
}