#include <stdio.h>
#include <ctype.h>
#include <windows.h>

int main () {
    //виставляю кодировку виводу консолі в UTF-8
    SetConsoleOutputCP(65001);
    SetConsoleCP(65001);

    // Задача 2. Для безпечного входу в систему робота-асистента додаток
    // використовує додаткове шифрування літерних кодів. Щоб сторонній спостерігач
    // не перехопив пароль у відкритому вигляді, смарт-бот зашифровує кожну велику
    // латинську літеру коду зі зміщенням на K позицій уперед по алфавіту (наприклад,
    // при K = 3 символ 'A' → 'D', а 'Z' → 'C').

    // Завдання. Напишіть програму, яка:
    // 1. Отримує від користувача одну велику латинську літеру (тип char) та
    // число зміщення K (тип int).
    // 2. Виконує перевірку коректності введення двома різними способами (для
    // порівняння у коді):
    // Спосіб 1 – за допомогою функції з бібліотеки <ctype.h.
    // Спосіб 2 – за допомогою аналізу ASCII-кодів. ( перевірити ту саму
    // умову безпосередньо через діапазон ASCII-кодів.
    // 3. Якщо символ не є великою латинською літерою (за результатами обох
    // перевірок) – виводить повідомлення про помилку.
    // 4. Якщо символ коректний – виконує шифрування за допомогою символьної
    // арифметики.
    // 5. Виводить на екран:

    // ➢ результати обох перевірок (чи збігаються висновки функції та
    // порівняння ASCII-кодів).
    // ➢ введений символ та його десятковий ASCII-код (%c та %d).
    // ➢ зашифрований символ та його новий ASCII-код.

    char input_char;
    int K;
    
    printf("Введіть велику латинську літеру: ");
    scanf(" %c", &input_char);
    printf("Введіть зміщення: ");
    scanf("%d", &K);
    if (K < 0) {
        printf("Помилка: Зміщення K повинно бути невід'ємним числом.");
        return 1;
    }

    printf("Спосіб 1: Перевірка за допомогою <ctype.h>");
    if (isalpha(input_char) && isupper(input_char)) {
        printf("Перевірка за допомогою <ctype.h>: Символ є великою латинською літерою.");
    } else {
        printf("Перевірка за допомогою <ctype.h>: Символ не є великою латинською літерою.");
        return 1;
    }

    printf("Спосіб 2: Перевірка за допомогою ASCII-кодів");
    if (input_char >= 'A' && input_char <= 'Z') {
        printf("Перевірка за допомогою ASCII-кодів: Символ є великою латинською літерою.");
    } else {
        printf("Перевірка за допомогою ASCII-кодів: Символ не є великою латинською літерою.");
        return 1;
    }

    //шифрування
    char encrypted_char = ((input_char - 'A' + K) % 26) + 'A';

    //виведення результатів
    printf("Введений символ: %c (ASCII: %d)", input_char, input_char);
    printf("Зашифрований символ: %c (ASCII: %d)", encrypted_char, encrypted_char);

    return 0;
}